In [1]:
# Pandas 
# A powerful data manipulation and analysis library for Python.
# It is useful for working with tabular data, time series, and various data formats.
# use case of pandas are data cleaning, transformation, analysis tasks , aggregation, file handling, filtering.
# content table of pandas: series, dataframes, indexing, selection, filtering, grouping, merging, reshaping, time series functionality, input/output operations.
# Pandas is built on top of Python programming language.
# It uses the NumPy library as its foundation.
# It provides data structures like DataFrames and Series for handling structured data.
# 
# Documentation: https://pandas.pydata.org/docs/
# Installation: pip install pandas
# Example Usage:
# import pandas as pd
# import pandas as pd


a = 89
b = 34
c = a + b
print(c)

123

In [2]:
# Series :- it is one-dimensional labeled array capable of holding any data type.
# It will show data in a single column with index labels (vertically).
# It can be created from lists, dictionaries, or NumPy arrays.
import pandas as pd
import numpy as np

data = [10, 20, 30, 40, 50]
list_data = ['a', 'b', 'c', 'd', 'e']
dict_data = {'a': 100, 'b': 200, 'c': 300}
array_data = np.array([1, 2, 3, 4, 5])
series = pd.Series(data)
series_list = pd.Series(list_data)
series_dict = pd.Series(dict_data)
series_array = pd.Series(array_data)
series, series_list, series_dict, series_array
pd.Series(data, index=['A', 'B', 'C', 'D', 'E'])

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [9]:
# DataFrame :- it is a two-dimensional labeled data structure with columns of potentially different types.
# It is similar to a spreadsheet or SQL table.
# Operations like filtering, grouping, and aggregation can be performed on DataFrames.
# DataFrames can be created from dictionaries, lists of lists, or NumPy arrays.
# topics of DataFrame: creation, indexing, selection, filtering, grouping, merging, reshaping, handling missing data, time series functionality, input/output operations.
 
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df
data_list = [['Alice', 25, 'New York', 70000],
             ['Bob', 30, 'Los Angeles', 80000],
             ['Charlie', 35, 'Chicago', 90000]]
df_list = pd.DataFrame(data_list)
df_list1 = pd.DataFrame(data_list, columns=['Name', 'Age', 'City', 'Salary'])
df_list1

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [10]:

# Indexing and Selection
df['Name']  # Select a single column
df[['Name', 'Age']]  # Select multiple columns
df.iloc[0]  # Select the first row by position
df.loc[0]  # Select the first row by label
df[df['Age'] > 28]  # Filter rows based on a condition
df.loc[df['Age'] > 28, ['Name', 'City']]  # Filter and select specific columns
df.set_index('Name', inplace=True)  # Set 'Name' column as index
df.reset_index(inplace=True)  # Reset index to default integer index
df.sort_values(by='Age')  # Sort DataFrame by 'Age' column
df.describe()  # Get summary statistics of numerical columns
df.info()  # Get information about DataFrame structure
df.isnull().sum()  # Check for missing values in each column
df.fillna(0, inplace=True)  # Fill missing values with 0
df.dropna(inplace=True)  # Drop rows with missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [11]:
# Creating a new column
df['Bonus'] = df['Salary'] * 0.1  # Create a new column 'Bonus' based on 'Salary'
df['Total_Salary'] = df['Salary'] + df['Bonus']  # Create another new column 'Total_Salary'
df
df['Designation'] = ['Manager', 'Developer', 'Analyst']  # Add a new column 'Designation'
df

      Name  Age         City  Salary   Bonus  Total_Salary Designation
0    Alice   25     New York   70000  7000.0       77000.0     Manager
1      Bob   30  Los Angeles   80000  8000.0       88000.0   Developer
2  Charlie   35      Chicago   90000  9000.0       99000.0     Analyst

In [33]:
# Drop or delete columns
# inplace=True modifies the original DataFrame instead of returning a new one.
#  it measns the operation will be performed directly on the existing DataFrame.
df.drop('Total_Salary', axis=1, inplace=True)  # Drop the 'Total_Salary' column
df

      Name  Age         City  Salary Designation   Bonus
0    Alice   25     New York   70000     Manager  7000.0
1      Bob   30  Los Angeles   80000   Developer  8000.0
2  Charlie   35      Chicago   90000     Analyst  9000.0

In [34]:
df

      Name  Age         City  Salary Designation   Bonus
0    Alice   25     New York   70000     Manager  7000.0
1      Bob   30  Los Angeles   80000   Developer  8000.0
2  Charlie   35      Chicago   90000     Analyst  9000.0

In [39]:
# Selecting specific rows and columns
df.loc[0]  # Select the first row
df.loc[[0,1]] # Select the value at first row and second column
# df.loc[1:2, ['Name', 'Salary']]  # Select rows with index 1 to 2 and columns 'Name' and 'Salary'
df.iloc[0]  # Select the first row by position

Name              Alice
Age                  25
City           New York
Salary            70000
Designation     Manager
Bonus            7000.0
Name: 0, dtype: object

In [8]:
# Selecting specific subset rows and columns
df.loc[df['Age'] > 28, ['Name', 'City']]  # Select rows where 'Age' > 28 and columns 'Name' and 'City'
df
df.loc[2]
df.loc[2][['Name','Salary']]

Name      Charlie
Salary      90000
Name: 2, dtype: object

In [14]:
# Concatenation and Merging
df1 = pd.DataFrame({    'Name': ['David', 'Eva'],
    'Age': [28, 32],
    'City': ['New York', 'London']})
df2 = pd.DataFrame({    'Name': ['Frank', 'Grace'],
    'Age': [29, 31],
    'City': ['Paris', 'Tokyo']})
df_concat = pd.concat([df1, df2], ignore_index=True)  # Concatenate DataFrames vertically
df_concat

    Name  Age      City
0  David   28  New York
1    Eva   32    London
2  Frank   29     Paris
3  Grace   31     Tokyo

In [15]:
# Conditional Selection
# Selecting rows based on conditions
# df.loc[df['Age'] > 28]  # Select rows where 'Age' > 28
# create a new dataframe with list

df.loc[df['City'] == 'New York']  # Select rows where 'City' is 'New York'
df.loc[(df['Age'] > 28) & (df['City'] == 'New York')]  # Select rows where 'Age' > 28 AND 'City' is 'New York'

Empty DataFrame
Columns: [Name, Age, City, Salary, Bonus, Total_Salary, Designation]
Index: []

In [26]:
# Find Missing data
df.isnull()  # Check for missing values
# create a dataframe with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, np.nan, 35, 28],
    'City': ['New York', 'Los Angeles', np.nan, 'Chicago']
}
df = pd.DataFrame(data)
df.isnull()  # Check for missing values
df.isnull().sum()  # Count missing values in each column
df.isna()  # Check for missing values
# df.isna().sum()  # Count missing values in each column
# Any missing value in each column
df.isna().any()  # Count missing values in each column
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0          NaN
3    David  28.0      Chicago

In [ ]:
# Removing Missing data
df.dropna()
df.dropna(thresh=2)  # Drop rows with less than 2 non-missing values
df.dropna(axis=1)  # Drop columns with any missing values
df.fillna(0)  # Fill missing values with 0
values = {'Age': df['Age'].mean(), 'City': 'Unknown'}
df.fillna(values)  # Fill missing values with specified values

      Name        Age         City
0    Alice  25.000000     New York
1      Bob  29.333333  Los Angeles
2  Charlie  35.000000      Unknown
3    David  28.000000      Chicago

In [ ]:
# Join

In [3]:
# Group By 
# df.groupby('Name')  # Group by a column
# df.groupby('City')['Salary'].mean()  # Group by 'City' and calculate mean 'Salary'
# df
# create a dataframe with coulmn 'Categrory' , 'Store', 'Sales' , "Quantity" and Date
import pandas as pd
data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Clothing', 'Clothing'],
    'Store': ['Store A', 'Store B', 'Store A', 'Store B', 'Store A', 'Store B'],
    'Sales': [1000, 1500, 2000, 2500, 3000, 3500],
    'Quantity': [5, 7, 10, 12, 15, 18],
    'Date': pd.date_range(start='2023-01-01', periods=6, freq='M')
}
df = pd.DataFrame(data)
df
# cat = df.groupby('Category')
# cat.sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_16944\3561572279.py:12: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  'Date': pd.date_range(start='2023-01-01', periods=6, freq='M')

      Category    Store  Sales  Quantity       Date
0  Electronics  Store A   1000         5 2023-01-31
1  Electronics  Store B   1500         7 2023-02-28
2    Furniture  Store A   2000        10 2023-03-31
3    Furniture  Store B   2500        12 2023-04-30
4     Clothing  Store A   3000        15 2023-05-31
5     Clothing  Store B   3500        18 2023-06-30

In [7]:
# Aggregation
df.groupby('Category').agg({'Sales': 'sum', 'Quantity': 'mean'})
df.groupby('Store').agg({'Sales': 'max', 'Quantity': 'min'})    
df['Sales'].mean()
df['Sales'].agg({'sum': 'sum', 'mean': 'mean', 'max': 'max', 'min': 'min'})

sum     13500.0
mean     2250.0
max      3500.0
min      1000.0
Name: Sales, dtype: float64

In [ ]:
# Pivot Tables :- It is a data summarization tool that is used in data processing.
# It allows you to reorganize and summarize selected columns and rows of data in a DataFrame
# create a pivot table data with coulmn 'date' 'region' 'sales' 'product', 'units' 'Rep', 'month', 'Quarter'
import pandas as pd
data = {
    'Date': pd.date_range(start='2023-01-01', periods=6, freq='M'),
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South'],
    'Sales': [100, 200, 150, 250, 300, 350],
    'Units': [10, 20, 15, 25, 30, 35],
    'Rep': ['John', 'Jane', 'John', 'Jane', 'John', 'Jane'],
    'Month': ['January', 'February', 'March', 'April', 'May', 'June'],
    'Quarter': ['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2']
}
df = pd.DataFrame(data)
df
pivot_table = pd.pivot_table(df, values='Sales', index='Product', columns='Region', aggfunc='sum', fill_value=0)
pivot_table
# df.groupby('Name')  # Group by a column
# df.groupby('City')['Salary'].mean()  # Group by 'City' and calculate mean 'Salary'
# df
# pivot table operations and functions

C:\Users\HP\AppData\Local\Temp\ipykernel_16944\1832408107.py:6: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  'Date': pd.date_range(start='2023-01-01', periods=6, freq='M'),

Region   North  South
Product
A          550      0
B            0    800

In [ ]:
# Operations and Functions
df['Sales'].mean()
# df['Sales'].agg({'sum': 'sum', 'mean': 'mean', 'max': 'max', 'min': 'min'}) 
df.shape  
df.columns
df.describe()
df[[]]

# all operations and functions on dataframe

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [ ]:
# Date and Time Handling
# df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime format
# df['Year'] = df['Date'].dt.year  # Extract year from 'Date'

In [ ]:
# Dataframe applying functions
df.apply(lambda x: x['Sales'] * 1.1 if x['Region'] == 'North' else x['Sales'] * 1.2, axis=1)
df.applymap(lambda x: x * 2 if isinstance(x, (int, float)) else x)  # Apply function to all elements in DataFrame

0    110.0
1    240.0
2    165.0
3    300.0
4    330.0
5    420.0
dtype: float64